------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/zhihao/Desktop/STATS506/Homework/hw3/ps3_q1.log
  log type:  text
 opened on:  23 Oct 2020, 20:33:42

. 
. // data prep: --------------------------------------------------------------- *
. // import and split data
. import delimited nhanes_demo.csv, clear
(11 vars, 39156 obs)

. save demo.dta, replace
file demo.dta saved

. import delimited nhanes_ohxden.csv, clear
(62 vars, 35909 obs)

. keep seqn ohddests

. merge 1:1 seqn using demo.dta

    Result                           # of obs.
    -----------------------------------------
    not matched                         3,247
        from master                         0  (_merge==1)
        from using                      3,247  (_merge==2)

    matched                            35,909  (_merge==3)
    -----------------------------------------

. generate ohx = 1

. replace ohx = 0 if ohddests != 1
(4,796 real changes made)

. // ohx label
. label define ohxnames ///
>   1 "Complete" ///
>   0 "Missing"

. label values ohx ohxnames

. // race labels
. label define racenames ///
>   1 "Mexican American" ///
>   2 "Other Hispanic" ///
>   3 "Non-Hispanic White" ///
>   4 "Non-Hispanic Black" ///
>   6 "Non-Hispanic Asian" ///
>   7 "Other Race - Including Multi-Racial" 

. label values ridreth3 racenames

. 
. drop if ridstatr != 2
(1,757 observations deleted)

. generate under20 = "<20"

. replace under20 = "20+" if ridageyr >= 20
(21,646 real changes made)

. generate edu = "Some college/College graduate"

. replace edu = "No college/Unknown" if dmdeduc2 != 3 & dmdeduc2 != 4
(25,957 real changes made)

. 
. 
. bys under20: tab ohx riagendr, col chi2

------------------------------------------------------------------------------------------------------------------------------
-> under20 = 20+

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |       RIAGENDR
       ohx |         1          2 |     Total
-----------+----------------------+----------
   Missing |       538        739 |     1,277 
           |      5.15       6.60 |      5.90 
-----------+----------------------+----------
  Complete |     9,916     10,453 |    20,369 
           |     94.85      93.40 |     94.10 
-----------+----------------------+----------
     Total |    10,454     11,192 |    21,646 
           |    100.00     100.00 |    100.00 

          Pearson chi2(1) =  20.6573   Pr = 0.000

------------------------------------------------------------------------------------------------------------------------------
-> under20 = <20

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |       RIAGENDR
       ohx |         1          2 |     Total
-----------+----------------------+----------
   Missing |       875        887 |     1,762 
           |     10.97      11.41 |     11.19 
-----------+----------------------+----------
  Complete |     7,102      6,889 |    13,991 
           |     89.03      88.59 |     88.81 
-----------+----------------------+----------
     Total |     7,977      7,776 |    15,753 
           |    100.00     100.00 |    100.00 

          Pearson chi2(1) =   0.7599   Pr = 0.383


. bys under20: tab ohx ridreth3, col chi2

------------------------------------------------------------------------------------------------------------------------------
-> under20 = 20+

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |                             RIDRETH3
       ohx | Mexican A  Other His  Non-Hispa  Non-Hispa  Non-Hispa  Other Rac |     Total
-----------+------------------------------------------------------------------+----------
   Missing |       197        165        359        283        241         32 |     1,277 
           |      6.75       7.33       4.52       5.71       8.61       4.10 |      5.90 
-----------+------------------------------------------------------------------+----------
  Complete |     2,722      2,086      7,585      4,670      2,558        748 |    20,369 
           |     93.25      92.67      95.48      94.29      91.39      95.90 |     94.10 
-----------+------------------------------------------------------------------+----------
     Total |     2,919      2,251      7,944      4,953      2,799        780 |    21,646 
           |    100.00     100.00     100.00     100.00     100.00     100.00 |    100.00 

          Pearson chi2(5) =  81.2509   Pr = 0.000

------------------------------------------------------------------------------------------------------------------------------
-> under20 = <20

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |                             RIDRETH3
       ohx | Mexican A  Other His  Non-Hispa  Non-Hispa  Non-Hispa  Other Rac |     Total
-----------+------------------------------------------------------------------+----------
   Missing |       400        200        566        369        108        119 |     1,762 
           |     12.43      11.80      13.12       9.49       7.17      10.52 |     11.19 
-----------+------------------------------------------------------------------+----------
  Complete |     2,817      1,495      3,748      3,520      1,399      1,012 |    13,991 
           |     87.57      88.20      86.88      90.51      92.83      89.48 |     88.81 
-----------+------------------------------------------------------------------+----------
     Total |     3,217      1,695      4,314      3,889      1,507      1,131 |    15,753 
           |    100.00     100.00     100.00     100.00     100.00     100.00 |    100.00 

          Pearson chi2(5) =  58.2237   Pr = 0.000


. 
end of do-file

. do "/var/folders/mg/sqp9g3yd2w788sn017x4tv3m0000gn/T//SD13488.000000"

. log close
      name:  <unnamed>
       log:  /Users/zhihao/Desktop/STATS506/Homework/hw3/ps3_q1.log
  log type:  text
 closed on:  23 Oct 2020, 20:34:13
------------------------------------------------------------------------------------------------------------------------------
