----------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/zhihao/Desktop/STATS506/Homework/hw3/ps3_q2.log
  log type:  text
 opened on:  26 Oct 2020, 11:09:56

. 
. // data prep: --------------------------------------------------------------- *
. // import and split data
. import delimited nhanes_demo.csv, clear
(11 vars, 39,156 obs)

. save demo.dta, replace
file demo.dta saved

. import delimited nhanes_ohxden.csv, clear
(62 vars, 35,909 obs)

. keep seqn ohddests

. merge 1:1 seqn using demo.dta

    Result                           # of obs.
    -----------------------------------------
    not matched                         3,247
        from master                         0  (_merge==1)
        from using                      3,247  (_merge==2)

    matched                            35,909  (_merge==3)
    -----------------------------------------

. generate ohx = 1

. replace ohx = 0 if ohddests != 1
(4,796 real changes made)

. rename ridageyr age

. // ohx label
. label define ohxnames ///
>   1 "Complete" ///
>   0 "Missing"

. label values ohx ohxnames

. // race labels
. label define racenames ///
>   1 "Mexican American" ///
>   2 "Other Hispanic" ///
>   3 "Non-Hispanic White" ///
>   4 "Non-Hispanic Black" ///
>   6 "Non-Hispanic Asian" ///
>   7 "Other Race - Including Multi-Racial" 

. label values ridreth3 racenames

. 
. drop if ridstatr != 2
(1,757 observations deleted)

. generate under20 = "<20"

. replace under20 = "20+" if age >= 20
(21,646 real changes made)

. generate edu = "Some college/College graduate"

. replace edu = "No college/Unknown" if dmdeduc2 != 3 & dmdeduc2 != 4
(25,957 real changes made)

. encode edu, gen(n_edu)

. encode under20, gen(u20)

. 
. // model fitting: ----------------------------------------------------------- *
. cd output
/Users/zhihao/Desktop/STATS506/Homework/hw3/output

. putexcel set ps3_q2.xlsx, sheet(logitreg) modify

. putexcel A1="model" B1= "AIC"
file ps3_q2.xlsx saved

. 
. logit ohx ///
>           c.age i.riagendr i.n_edu

Iteration 0:   log likelihood = -10540.281  
Iteration 1:   log likelihood = -10240.209  
Iteration 2:   log likelihood = -10226.513  
Iteration 3:   log likelihood = -10226.466  
Iteration 4:   log likelihood = -10226.466  

Logistic regression                             Number of obs     =     37,399
                                                LR chi2(3)        =     627.63
                                                Prob > chi2       =     0.0000
Log likelihood = -10226.466                     Pseudo R2         =     0.0298

------------------------------------------------------------------------------------------------
                           ohx |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------------------------+----------------------------------------------------------------
                           age |    .020316   .0010261    19.80   0.000     .0183048    .0223272
                    2.riagendr |  -.1425032   .0382543    -3.73   0.000    -.2174803   -.0675262
                               |
                         n_edu |
Some college/College graduate  |   .0511107   .0532713     0.96   0.337    -.0532991    .1555206
                         _cons |   1.931698   .0341934    56.49   0.000      1.86468    1.998716
------------------------------------------------------------------------------------------------

. estat ic

Akaike's information criterion and Bayesian information criterion

-----------------------------------------------------------------------------
       Model |        Obs  ll(null)  ll(model)      df         AIC        BIC
-------------+---------------------------------------------------------------
           . |     37,399 -10540.28  -10226.47       4    20460.93   20495.05
-----------------------------------------------------------------------------
               Note: N=Obs used in calculating BIC; see [R] BIC note.

. return list

matrices:
                  r(S) :  1 x 6

. matrix a = r(S)

. putexcel A2="c.age i.riagendr i.n_edu" B2= a[1,5]
file ps3_q2.xlsx saved

. 
. logit ohx ///
>           c.age##c.age i.riagendr i.n_edu

Iteration 0:   log likelihood = -10540.281  
Iteration 1:   log likelihood = -9777.3607  
Iteration 2:   log likelihood = -9669.6262  
Iteration 3:   log likelihood = -9669.5203  
Iteration 4:   log likelihood = -9669.5203  

Logistic regression                             Number of obs     =     37,399
                                                LR chi2(4)        =    1741.52
                                                Prob > chi2       =     0.0000
Log likelihood = -9669.5203                     Pseudo R2         =     0.0826

------------------------------------------------------------------------------------------------
                           ohx |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------------------------+----------------------------------------------------------------
                           age |   .1229969   .0033978    36.20   0.000     .1163374    .1296564
                               |
                   c.age#c.age |  -.0013736   .0000414   -33.15   0.000    -.0014548   -.0012924
                               |
                    2.riagendr |  -.1558077   .0389727    -4.00   0.000    -.2321927   -.0794227
                               |
                         n_edu |
Some college/College graduate  |  -.4765154   .0614925    -7.75   0.000    -.5970386   -.3559922
                         _cons |   1.220844    .038309    31.87   0.000      1.14576    1.295928
------------------------------------------------------------------------------------------------

. estat ic

Akaike's information criterion and Bayesian information criterion

-----------------------------------------------------------------------------
       Model |        Obs  ll(null)  ll(model)      df         AIC        BIC
-------------+---------------------------------------------------------------
           . |     37,399 -10540.28   -9669.52       5    19349.04   19391.69
-----------------------------------------------------------------------------
               Note: N=Obs used in calculating BIC; see [R] BIC note.

. return list

matrices:
                  r(S) :  1 x 6

. matrix a = r(S)

. putexcel A3="cc.age##c.age i.riagendr i.n_edu" B3= a[1,5]
file ps3_q2.xlsx saved

. 
. logit ohx ///
>           c.age##c.age##i.riagendr i.n_edu

Iteration 0:   log likelihood = -10540.281  
Iteration 1:   log likelihood = -9772.9954  
Iteration 2:   log likelihood = -9661.8026  
Iteration 3:   log likelihood = -9661.6469  
Iteration 4:   log likelihood = -9661.6469  

Logistic regression                             Number of obs     =     37,399
                                                LR chi2(6)        =    1757.27
                                                Prob > chi2       =     0.0000
Log likelihood = -9661.6469                     Pseudo R2         =     0.0834

------------------------------------------------------------------------------------------------
                           ohx |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------------------------+----------------------------------------------------------------
                           age |   .1352781    .004866    27.80   0.000     .1257409    .1448153
                               |
                   c.age#c.age |  -.0015131   .0000615   -24.58   0.000    -.0016337   -.0013924
                               |
                    2.riagendr |   .0467312   .0643103     0.73   0.467    -.0793148    .1727771
                               |
                riagendr#c.age |
                            2  |  -.0223889   .0061624    -3.63   0.000    -.0344669   -.0103108
                               |
          riagendr#c.age#c.age |
                            2  |   .0002524     .00008     3.16   0.002     .0000956    .0004092
                               |
                         n_edu |
Some college/College graduate  |   -.471773   .0615466    -7.67   0.000    -.5924022   -.3511439
                         _cons |   1.114486   .0461494    24.15   0.000     1.024035    1.204937
------------------------------------------------------------------------------------------------

. estat ic

Akaike's information criterion and Bayesian information criterion

-----------------------------------------------------------------------------
       Model |        Obs  ll(null)  ll(model)      df         AIC        BIC
-------------+---------------------------------------------------------------
           . |     37,399 -10540.28  -9661.647       7    19337.29      19397
-----------------------------------------------------------------------------
               Note: N=Obs used in calculating BIC; see [R] BIC note.

. return list

matrices:
                  r(S) :  1 x 6

. matrix a = r(S)

. putexcel A4="cc.age##c.age##i.riagendr i.n_edu" B4= a[1,5]
file ps3_q2.xlsx saved

. 
. logit ohx ///
>           c.age##c.age i.riagendr i.n_edu i.u20 

Iteration 0:   log likelihood = -10540.281  
Iteration 1:   log likelihood = -9471.0017  
Iteration 2:   log likelihood = -9166.4729  
Iteration 3:   log likelihood = -9165.3451  
Iteration 4:   log likelihood = -9165.3446  

Logistic regression                             Number of obs     =     37,399
                                                LR chi2(5)        =    2749.87
                                                Prob > chi2       =     0.0000
Log likelihood = -9165.3446                     Pseudo R2         =     0.1304

------------------------------------------------------------------------------------------------
                           ohx |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------------------------+----------------------------------------------------------------
                           age |   .2568518    .005924    43.36   0.000     .2452411    .2684626
                               |
                   c.age#c.age |  -.0024895   .0000592   -42.08   0.000    -.0026055   -.0023736
                               |
                    2.riagendr |  -.1634455   .0397273    -4.11   0.000    -.2413095   -.0855814
                               |
                         n_edu |
Some college/College graduate  |   .2960244   .0595103     4.97   0.000     .1793863    .4126625
                               |
                           u20 |
                          <20  |   3.685932    .121144    30.43   0.000     3.448494     3.92337
                         _cons |  -2.880109   .1384156   -20.81   0.000    -3.151398   -2.608819
------------------------------------------------------------------------------------------------

. estat ic

Akaike's information criterion and Bayesian information criterion

-----------------------------------------------------------------------------
       Model |        Obs  ll(null)  ll(model)      df         AIC        BIC
-------------+---------------------------------------------------------------
           . |     37,399 -10540.28  -9165.345       6    18342.69   18393.87
-----------------------------------------------------------------------------
               Note: N=Obs used in calculating BIC; see [R] BIC note.

. return list

matrices:
                  r(S) :  1 x 6

. matrix a = r(S)

. putexcel A5="c.age##c.age i.riagendr i.n_edu i.u20 " B5= a[1,5]
file ps3_q2.xlsx saved

. 
. logit ohx ///
>           c.age##c.age##i.u20 i.riagendr i.n_edu

Iteration 0:   log likelihood = -10540.281  
Iteration 1:   log likelihood = -9901.5735  
Iteration 2:   log likelihood = -8588.8214  
Iteration 3:   log likelihood = -7593.5223  
Iteration 4:   log likelihood = -7471.7189  
Iteration 5:   log likelihood = -7467.6461  
Iteration 6:   log likelihood = -7467.6364  
Iteration 7:   log likelihood = -7467.6364  

Logistic regression                             Number of obs     =     37,399
                                                LR chi2(7)        =    6145.29
                                                Prob > chi2       =     0.0000
Log likelihood = -7467.6364                     Pseudo R2         =     0.2915

------------------------------------------------------------------------------------------------
                           ohx |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------------------------+----------------------------------------------------------------
                           age |  -.0426617   .0105793    -4.03   0.000    -.0633968   -.0219267
                               |
                   c.age#c.age |   .0004042   .0001032     3.92   0.000     .0002019    .0006066
                               |
                           u20 |
                          <20  |  -4.701353   .2601693   -18.07   0.000    -5.211276   -4.191431
                               |
                     u20#c.age |
                          <20  |   1.579684   .0384756    41.06   0.000     1.504273    1.655095
                               |
               u20#c.age#c.age |
                          <20  |  -.0726282   .0019523   -37.20   0.000    -.0764546   -.0688018
                               |
                    2.riagendr |  -.1797175   .0448959    -4.00   0.000    -.2677119   -.0917231
                               |
                         n_edu |
Some college/College graduate  |   .1174599   .0579192     2.03   0.043     .0039403    .2309795
                         _cons |   3.807693    .256311    14.86   0.000     3.305332    4.310053
------------------------------------------------------------------------------------------------

. estat ic

Akaike's information criterion and Bayesian information criterion

-----------------------------------------------------------------------------
       Model |        Obs  ll(null)  ll(model)      df         AIC        BIC
-------------+---------------------------------------------------------------
           . |     37,399 -10540.28  -7467.636       8    14951.27   15019.51
-----------------------------------------------------------------------------
               Note: N=Obs used in calculating BIC; see [R] BIC note.

. return list

matrices:
                  r(S) :  1 x 6

. matrix a = r(S)

. putexcel A6="c.age##c.age##i.u20 i.riagendr i.n_edu" B6= a[1,5]
file ps3_q2.xlsx saved

. 
. 
. logit ohx ///
>           c.age##c.age##i.u20 i.riagendr i.n_edu

Iteration 0:   log likelihood = -10540.281  
Iteration 1:   log likelihood = -9901.5735  
Iteration 2:   log likelihood = -8588.8214  
Iteration 3:   log likelihood = -7593.5223  
Iteration 4:   log likelihood = -7471.7189  
Iteration 5:   log likelihood = -7467.6461  
Iteration 6:   log likelihood = -7467.6364  
Iteration 7:   log likelihood = -7467.6364  

Logistic regression                             Number of obs     =     37,399
                                                LR chi2(7)        =    6145.29
                                                Prob > chi2       =     0.0000
Log likelihood = -7467.6364                     Pseudo R2         =     0.2915

------------------------------------------------------------------------------------------------
                           ohx |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------------------------+----------------------------------------------------------------
                           age |  -.0426617   .0105793    -4.03   0.000    -.0633968   -.0219267
                               |
                   c.age#c.age |   .0004042   .0001032     3.92   0.000     .0002019    .0006066
                               |
                           u20 |
                          <20  |  -4.701353   .2601693   -18.07   0.000    -5.211276   -4.191431
                               |
                     u20#c.age |
                          <20  |   1.579684   .0384756    41.06   0.000     1.504273    1.655095
                               |
               u20#c.age#c.age |
                          <20  |  -.0726282   .0019523   -37.20   0.000    -.0764546   -.0688018
                               |
                    2.riagendr |  -.1797175   .0448959    -4.00   0.000    -.2677119   -.0917231
                               |
                         n_edu |
Some college/College graduate  |   .1174599   .0579192     2.03   0.043     .0039403    .2309795
                         _cons |   3.807693    .256311    14.86   0.000     3.305332    4.310053
------------------------------------------------------------------------------------------------

. putexcel set ps3_q2.xlsx, sheet(regout) modify

. putexcel A1 = etable
file ps3_q2.xlsx saved

. log close
      name:  <unnamed>
       log:  /Users/zhihao/Desktop/STATS506/Homework/hw3/ps3_q2.log
  log type:  text
 closed on:  26 Oct 2020, 11:10:01
----------------------------------------------------------------------------------------------------
